Merge branch 'main' into reasoning-effort
Signed-off-by: Svyatoslav <85786374+slivanovich@users.noreply.github.com>
